toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
#include <msp430.h>
#include <stdint.h>
#include <stdbool.h>
#include <inttypes.h>
#include <cstddef>
#include <atomic>
#define TaskMSP430
#include "Toastbox/Task.h"
#include "SDCard.h"
#include "ICE.h"
#include "ImgSensor.h"
#include "ImgAutoExposure.h"
#include "Startup.h"
#include "GPIO.h"
#include "Clock.h"
#include "RTC.h"
#include "SPI.h"
#include "WDT.h"
#include "FRAMWriteEn.h"
#include "Util.h"
#include "MSP.h"
#include "GetBits.h"
#include "Toastbox/IntState.h"
#include "ImgSD.h"
#include "I2C.h"
#include "OutputPriority.h"
#include "Battery.h"
using namespace GPIO;

#define Assert(x) if (!(x)) _MainError(__LINE__)
#define AssertArg(x) if (!(x)) _MainError(__LINE__)

static constexpr uint64_t _MCLKFreqHz       = 16000000;
static constexpr uint32_t _XT1FreqHz        = 32768;
static constexpr uint32_t _SysTickPeriodUs  = 512;

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line);

struct _Pin {
    // Port A
    using VDD_B_1V8_IMG_SD_EN       = PortA::Pin<0x0, Option::Output0>;
    using LED_GREEN_                = PortA::Pin<0x1, Option::Output1>;
    using MSP_STM_I2C_SDA           = PortA::Pin<0x2>;
    using MSP_STM_I2C_SCL           = PortA::Pin<0x3>;
    using ICE_MSP_SPI_DATA_OUT      = PortA::Pin<0x4>;
    using ICE_MSP_SPI_DATA_IN       = PortA::Pin<0x5>;
    using ICE_MSP_SPI_CLK           = PortA::Pin<0x6>;
    using BAT_CHRG_LVL              = PortA::Pin<0x7, Option::Input>; // No pullup/pulldown because this is an analog input (and the voltage divider provides a physical pulldown)
    using MSP_XOUT                  = PortA::Pin<0x8>;
    using MSP_XIN                   = PortA::Pin<0x9>;
    using LED_RED_                  = PortA::Pin<0xA, Option::Output1>;
    using VDD_B_2V8_IMG_SD_EN       = PortA::Pin<0xB, Option::Output0>;
    using MOTION_SIGNAL             = PortA::Pin<0xC, Option::Input, Option::Interrupt01, Option::Resistor0>; // Motion sensor can only drive 1, so we have a pulldown
    using BUTTON_SIGNAL_            = PortA::Pin<0xD, Option::Input, Option::Interrupt10, Option::Resistor1>; // Button can only drive 0, so we have a pullup
    using BAT_CHRG_LVL_EN           = PortA::Pin<0xE, Option::Output0>;
    using VDD_B_3V3_STM             = PortA::Pin<0xF, Option::Input, Option::Resistor0>;
    // Port B
    using MOTION_EN_                = PortB::Pin<0x0, Option::Output1>;
    using VDD_B_EN                  = PortB::Pin<0x1, Option::Output0>;
    using _UNUSED0                  = PortB::Pin<0x2>;
};

class _MainTask;
class _SDTask;
class _ImgTask;
class _I2CTask;

static void _Sleep();

static void _MainError(uint16_t line);
static void _SchedulerError(uint16_t line);
static void _ICEError(uint16_t line);
static void _SDError(uint16_t line);
static void _ImgError(uint16_t line);
static void _I2CError(uint16_t line);

extern uint8_t _StackMain[];

#warning disable stack guard for production
static constexpr size_t _StackGuardCount = 16;
using _Scheduler = Toastbox::Scheduler<
    _SysTickPeriodUs,                           // T_UsPerTick: microseconds per tick
    Toastbox::IntState::SetInterruptsEnabled,   // T_SetInterruptsEnabled: function to change interrupt state
    _Sleep,                                     // T_Sleep: function to put processor to sleep;
                                                //          invoked when no tasks have work to do
    _SchedulerError,                            // T_Error: function to handle unrecoverable error
    _StackMain,                                 // T_MainStack: main stack pointer (only used to monitor
                                                //              main stack for overflow; unused if T_StackGuardCount==0)
    _StackGuardCount,                           // T_StackGuardCount: number of pointer-sized stack guard elements to use
    _MainTask,                                  // T_Tasks: list of tasks
    _SDTask,
    _ImgTask,
    _I2CTask
>;

using _Clock = ClockType<_MCLKFreqHz>;
using _SysTick = WDTType<_MCLKFreqHz, _SysTickPeriodUs>;
using _SPI = SPIType<_MCLKFreqHz, _Pin::ICE_MSP_SPI_CLK, _Pin::ICE_MSP_SPI_DATA_OUT, _Pin::ICE_MSP_SPI_DATA_IN>;
using _ICE = ICE<_Scheduler, _ICEError>;

using _I2C = I2CType<_Scheduler, _Pin::MSP_STM_I2C_SCL, _Pin::MSP_STM_I2C_SDA, _Pin::VDD_B_3V3_STM, MSP::I2CAddr, _I2CError>;

using _Battery = BatteryType<_Scheduler, _Pin::BAT_CHRG_LVL, _Pin::BAT_CHRG_LVL_EN>;

using _LEDGreen_ = OutputPriority<_Pin::LED_GREEN_>;
using _LEDRed_ = OutputPriority<_Pin::LED_RED_>;

// _ImgSensor: image sensor object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
using _ImgSensor = Img::Sensor<
    _Scheduler,             // T_Scheduler
    _ICE,                   // T_ICE
    _ImgError               // T_Error
>;

// _SDCard: SD card object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
using _SDCard = SD::Card<
    _Scheduler,         // T_Scheduler
    _ICE,               // T_ICE
    _SDError,           // T_Error
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    6                   // T_ClkDelayFast (odd values invert the clock)
>;

// _RTC: real time clock
using _RTC = RTCType<_XT1FreqHz, _Pin::MSP_XOUT, _Pin::MSP_XIN>;

// _State: stores MSPApp persistent state, intended to be read/written by outside world
// Stored in 'Information Memory' (FRAM) because it needs to persist indefinitely
[[gnu::section(".fram_info.main")]]
static MSP::State _State = {
    .header = MSP::StateHeader,
};

// MARK: - Power

static void _VDDBSet(bool en) {
    _Pin::VDD_B_EN::Write(en);
    // Rails take ~1.5ms to turn on/off, so wait 2ms to be sure
    _Scheduler::Sleep(_Scheduler::Ms(2));
}

static void _VDDIMGSDSet(bool en) {
    // Short-circuit if the pin state hasn't changed, to save us the Sleep()
    if (_Pin::VDD_B_2V8_IMG_SD_EN::Read() == en) return;
    
    if (en) {
        _Pin::VDD_B_2V8_IMG_SD_EN::Write(1);
        _Scheduler::Sleep(_Scheduler::Us(100)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
        _Pin::VDD_B_1V8_IMG_SD_EN::Write(1);
        
