toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
//        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
        const MSP::ImgRingBuf& imgRingBuf = _State.sd.imgRingBufs[0];
        
        // Init SPI peripheral
        _SPI::Init();
        
        for (;;) {
            // Enter host mode if necessary
            _HostModeHandle();
            
//            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
//            {
//                _WaitingForMotion = true;
//                _Scheduler::Wait([&] { return (bool)_Motion; });
//                _Motion = false;
//                _WaitingForMotion = false;
//            }
            
//            // Turn on VDD_B power (turns on ICE40)
//            _VDDBSet(true);
//            
//            // Wait for ICE40 to start
//            // We specify (within the bitstream itself, via icepack) that ICE40 should load
//            // the bitstream at high-frequency (40 MHz).
//            // According to the datasheet, this takes 70ms.
//            _Scheduler::Sleep(_Scheduler::Ms(30));
//            _ICEInit();
//            
//            // Reset SD nets before we turn on SD power
//            _SDTask::Reset();
//            _SDTask::Wait();
//            
//            // Turn on IMG/SD power
//            _VDDIMGSDSet(true);
//            
//            // Init image sensor / SD card
//            _ImgTask::Init();
//            _SDTask::Init();
            
            for (;;) {
                // Capture an image
                {
                    _LEDGreen_::Set(_LEDGreen_::Priority::Low, 0);
                    
                    // Pretend to capture an image
                    _Scheduler::Sleep(_Scheduler::Ms(500));
                    
//                    // Wait for _SDTask to be initialized and done with writing, which is necessary
//                    // for 2 reasons:
//                    //   1. we have to wait for _SDTask to initialize _State.sd.imgRingBufs before we
//                    //      access it,
//                    //   2. we can't initiate a new capture until writing to the SD card (from a
//                    //      previous capture) is complete (because the SDRAM is single-port, so
//                    //      we can only read or write at one time)
//                    _SDTask::WaitForInitAndWrite();
//                    
//                    // Capture image to RAM
//                    _ImgTask::Capture(imgRingBuf.buf.idEnd);
//                    const uint8_t srcRAMBlock = _ImgTask::CaptureBlock();
//                    
//                    // Copy image from RAM -> SD card
//                    _SDTask::Write(srcRAMBlock);
//                    _SDTask::Wait();
                    
                    _LEDGreen_::Set(_LEDGreen_::Priority::Low, 1);
                }
                
                break;
                
//                // Wait up to 1s for further motion
//                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
//                if (!motion) break;
//                
//                // Only reset _Motion if we've observed motion; otherwise, if we always reset
//                // _Motion, there'd be a race window where we could first observe
//                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
//                // the true value by resetting it to false.
//                _Motion = false;
            }
            
//            _VDDIMGSDSet(false);
//            _VDDBSet(false);
            
            _Scheduler::Sleep(_Scheduler::Ms(3000));
        }
    }
    
    static bool DeepSleepOK() {
        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
        // This logic works because if _WaitingForMotion==true, then we've disabled both _SDTask
        // and _ImgTask, so if the tasks are idle, then everything's idle so we can enter deep
        // sleep. (The case that we need to be careful of is going to sleep when either _SDTask
        // or _ImgTask is idle but still powered on, which the _WaitingForMotion check takes
        // care of.)
        return _WaitingForMotion                &&
               !_Scheduler::Running<_SDTask>()  &&
               !_Scheduler::Running<_ImgTask>() ;
    }
    
    static void HostModeSet(bool en) {
        Assert(!_HostModeRequest);
        _HostModeRequest = en;
        // Wait until the request is consumed
        _Scheduler::Wait([&] { return !_HostModeRequest; });
    }
    
    static void ISR_MotionSignal(uint16_t iv) {
        _Motion = true;
    }
    
    static void _HostModeHandle() {
        if (!_HostModeRequest) return; // Short-circuit if there's no pending request
        for (;;) {
            // Consume the request
            const bool en = *_HostModeRequest;
            _HostModeRequest = std::nullopt;
            // If host mode is disabled; bail
            if (!en) return;
            // Host mode is enabled; park here and wait for further requests
            _Scheduler::Wait([&] { return _HostModeRequest; });
        }
    }
    
    // _Motion: announces that motion occurred
    // atomic because _Motion is modified from the interrupt context
    static inline std::atomic<bool> _Motion = false;
    static inline bool _WaitingForMotion = false;
    
    static inline std::optional<bool> _HostModeRequest;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
    // Task stack
    [[gnu::section(".stack._MainTask")]]
    static inline uint8_t Stack[256];
};

struct _I2CTask {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            for (int i=0;; i++) {
                // Wait for a command
                MSP::Cmd cmd;
                
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            Assert(false);
            
