toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            // Cleanup
            
            // Relinquish LEDs
            _LEDRed_::Set(_LEDRed_::Priority::High, std::nullopt);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, std::nullopt);
            
            // Exit host mode
            _MainTask::HostModeSet(false);
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.chunk * sizeof(MSP::Resp::arg.StateRead.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.chunk * sizeof(MSP::Cmd::arg.StateWrite.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDRed_::Priority::High, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeSet:
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            _MainTask::HostModeSet(cmd.arg.HostModeSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatterySample:
            // TODO: implement
            return MSP::Resp{ .ok = false };
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    static inline bool _HostMode = false;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
    // Task stack
    [[gnu::section(".stack._I2CTask")]]
    static inline uint8_t Stack[256];
};

// MARK: - IntState

inline bool Toastbox::IntState::InterruptsEnabled() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::SetInterruptsEnabled(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    // If deep sleep is OK, enter LPM3.5 sleep, where RAM content is lost.
    // Otherwise, enter LPM1 sleep, because something is running.
    const uint16_t LPMBits = (_MainTask::DeepSleepOK() ? LPM3_bits : LPM1_bits);
    
    // If we're entering LPM3, disable regulator so we enter LPM3.5 (instead of just LPM3)
    if (LPMBits == LPM3_bits) {
        PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_L;
    }
    
    // Atomically enable interrupts and go to sleep
    const bool prevEn = Toastbox::IntState::InterruptsEnabled();
    __bis_SR_register(GIE | LPMBits);
    // If interrupts were disabled previously, disable them again
    if (!prevEn) Toastbox::IntState::SetInterruptsEnabled(false);
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC::ISR();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (__even_in_range(iv, 0x10)) {
    case _Pin::MOTION_SIGNAL::IVPort2():
        _MainTask::ISR_MotionSignal(iv);
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    default:
        break;
    }
}

[[gnu::interrupt(USCI_B0_VECTOR)]]
static void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    __bic_SR_register_on_exit(LPM0_bits);
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

// MARK: - Abort

namespace AbortDomain {
    static constexpr uint16_t Invalid       = 0;
    static constexpr uint16_t Main          = 1;
    static constexpr uint16_t Scheduler     = 2;
    static constexpr uint16_t ICE           = 3;
    static constexpr uint16_t SD            = 4;
    static constexpr uint16_t Img           = 5;
    static constexpr uint16_t I2C           = 6;
}

[[noreturn]]
static void _MainError(uint16_t line) {
    _Abort(AbortDomain::Main, line);
}

[[noreturn]]
static void _SchedulerError(uint16_t line) {
    _Abort(AbortDomain::Scheduler, line);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _Abort(AbortDomain::ICE, line);
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _Abort(AbortDomain::SD, line);
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _Abort(AbortDomain::Img, line);
}

[[noreturn]]
static void _I2CError(uint16_t line) {
    _Abort(AbortDomain::I2C, line);
}

static void _AbortRecord(const MSP::Time& timestamp, uint16_t domain, uint16_t line) {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    AbortHistory* hist = nullptr;
    for (AbortHistory& h : _State.aborts) {
        if (!h.count || (h.type.domain == domain && h.type.line == line)) {
            hist = &h;
            break;
        }
    }
    
    // If we don't have a place to record the abort, bail
    if (!hist) return;
    
